In [1]:
import pandas as pd
import sklearn

In [42]:
data = pd.read_csv("data/titanic.csv")
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [43]:
# taking the columns that affect the survival rate
input = data[["Pclass", 'Sex' ,'Age', 'Fare']]
target = data.Survived

In [4]:
input.shape

(891, 4)

In [44]:
# checking the null values
input.columns[input.isna().any()]

Index(['Age'], dtype='object')

In [45]:
input.Age = input.Age.fillna(input.Age.mean())

C:\Users\HP\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\core\generic.py:5494: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

In [37]:
input.head(6)

   Pclass     Sex        Age     Fare
0       3    male  22.000000   7.2500
1       1  female  38.000000  71.2833
2       3  female  26.000000   7.9250
3       1  female  35.000000  53.1000
4       3    male  35.000000   8.0500
5       3    male  29.699118   8.4583

In [46]:
# now converting the Sex into label encoded or dummy values
dummy = pd.get_dummies(input.Sex)
dummy.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [51]:
# concating the dummy and input
input = pd.concat([input, dummy], axis='columns')
input.head()

   Pclass   Age     Fare  female  male  female  male
0       3  22.0   7.2500       0     1       0     1
1       1  38.0  71.2833       1     0       1     0
2       3  26.0   7.9250       1     0       1     0
3       1  35.0  53.1000       1     0       1     0
4       3  35.0   8.0500       0     1       0     1

In [48]:
input = input.drop("Sex", axis = 'columns')
input.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [49]:
# lets split the dataset now
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(input, target, test_size=0.1)

In [50]:
# importing the naive bayes model
from sklearn.naive_bayes import GaussianNB

model = GaussianNB()

model.fit(X_train, y_train)

GaussianNB()

In [56]:
model.score(X_test, y_test)

0.7777777777777778

In [59]:
model.predict(X_test[:6])

array([1, 0, 1, 0, 0, 1], dtype=int64)

In [60]:
y_test[:6]

777    1
451    0
68     1
165    1
645    1
609    1
Name: Survived, dtype: int64